Tekla Open API Reference for Tekla Structures 2025
PointCloud.Url Property
 Gets or sets the point clouds URL without a file name.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Url { get; set; }
Public Property Url As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace